trade_exp/src/Documents/НачислениеУдержаний/НачислениеУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5d8a03cd-d5c8-46f5-ab14-2d869dcf74d4">
  <name>НачислениеУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="16445800-7967-449f-8c66-23c16a28c879">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d6100e2-9f67-45ae-a549-786006e4950f">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e982ee89-17c2-4250-aa5e-cfb6c417006d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="81364a2d-6fde-4a09-951a-52338aa0b523">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d459c4c0-3fe2-4351-b78a-ae457b79e35d">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7397e03f-aef7-423c-86cc-3f0a146a6bae">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e816dce6-75e3-493d-9996-c99d809ef457">
      <name>СуммаЗадержки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="10358a37-0ede-4894-a3ef-241cc82251d1">
      <name>СуммаУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60dd34e3-5436-4697-a77f-64a2952a97ee">
      <name>СуммаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec73c35f-b1e7-4dc5-8812-ee153d6cd933">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/НачислениеУдержаний/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.НачислениеУдержаний.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеУдержанийНачисления.Ссылка.Номер КАК Номер,
	|	НачислениеУдержанийНачисления.Ссылка.Дата КАК Дата,
	|	НачислениеУдержанийНачисления.Ссылка.Автор КАК Автор,
	|	НачислениеУдержанийНачисления.Ссылка.Комментарий КАК Комментарий,
	|	НачислениеУдержанийНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	НачислениеУдержанийНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(НачислениеУдержанийНачисления.СуммаУдержания) КАК СуммаУдержания,
	|	СУММА(НачислениеУдержанийНачисления.СуммаВозврата) КАК СуммаВозврата,
	|	НачислениеУдержанийНачисления.Ссылка КАК Ссылка,
	|	СУММА(НачислениеУдержанийНачисления.СуммаЗадержки) КАК СуммаЗадержки
	|ИЗ
	|	Документ.НачислениеУдержаний.Начисления КАК НачислениеУдержанийНачисления
	|ГДЕ
	|	НачислениеУдержанийНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеУдержанийНачисления.Ссылка.Дата,
	|	НачислениеУдержанийНачисления.Ссылка.Автор,
	|	НачислениеУдержанийНачисления.Ссылка.Комментарий,
	|	НачислениеУдержанийНачисления.Ссылка.ПериодНачисления,
	|	НачислениеУдержанийНачисления.Сотрудник,
	|	НачислениеУдержанийНачисления.Ссылка.Номер,
	|	НачислениеУдержанийНачисления.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеУдержанийНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаУдержания),
	|	СУММА(СуммаВозврата),
	|	СУММА(СуммаЗадержки)
	|ПО
	|	Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачисленияШапка = Макет.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = Макет.ПолучитьОбласть("Начисления");
	ОбластьНачисленияИтого = Макет.ПолучитьОбласть("НачисленияИтого");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьНачисленияИтого.Параметры.Заполнить(Выборка);
		
		Шапка.Параметры.Заполнить(Выборка);
		//Месяц начисления
		Шапка.Параметры.МесяцНачисления= АльтерраОбщегоНазначения.ПолучитьМесяцСтрокой(Выборка.ПериодНачисления);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьНачисленияШапка);
		
		Ном= 1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;
			ТабДок.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
			Ном= Ном+1;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьНачисленияИтого);
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
